#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/solidworld/backend-test/runs/run-mPzv6xHpTc4Ci65W

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=logical-toucan]
data.aws_ami.ubuntu: Reading...
aws_security_group.backendtest-sg: Refreshing state... [id=sg-0cc0bb56d2549b5b5]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0d203747b007677da]
aws_instance.backendtest: Refreshing state... [id=i-03f8566e26766fc13]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.backendtest must be replaced
-/+ resource "aws_instance" "backendtest" {
      ~ ami                          = "ami-057fb6ca30447d5c7" -> "ami-0d203747b007677da" # forces replacement
      ~ arn                          = "arn:aws:ec2:eu-central-1:395164571819:instance/i-03f8566e26766fc13" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "eu-central-1c" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03f8566e26766fc13" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0a328194d7c064e6e" -> (known after apply)
      ~ private_dns                  = "ip-172-31-0-166.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                   = "172.31.0.166" -> (known after apply)
      ~ public_dns                   = "ec2-3-68-113-119.eu-central-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "3.68.113.119" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "logical-toucan-sg",
        ] -> (known after apply)
      ~ subnet_id                    = "subnet-08160fff61752cff9" -> (known after apply)
        tags                         = {
            "Name" = "backendtest"
        }
      ~ tenancy                      = "default" -> (known after apply)
        # (5 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-03d3a3f7876582f1a" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ backendtest_dns = "ec2-3-68-113-119.eu-central-1.compute.amazonaws.com" -> (known after apply)

```

</details>

*Pushed by: @freitasgouvea, Action: `pull_request`*